{
  "backend/main.mo": "Main actor entry point that traps on startPollRequest to prevent polling calls in the main.loop actor.",
  "feature_evidence.json": "Feature evidence report documenting three design refinement features: color palette/shadows, spacing/typography hierarchy, and micro-interactions/animations across frontend components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components, pages, hooks, and configuration with details on routing, authentication, styling, and real-time data synchronization.",
  "frontend/index.css": "Tailwind base styles with CSS custom properties defining OKLCH color system for light and dark themes, including sidebar, chart, and UI component color tokens.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the AegisLand application.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with six routes (home, search, dashboard, property details, transfer, register), theme provider, and toast notifications.",
  "frontend/src/components/Footer.tsx": "Application footer with three-column grid layout featuring app description, quick links, social icons, copyright notice, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, nav links, theme toggle, Internet Identity authentication dropdown, and mobile sheet menu with smooth transitions and backdrop blur.",
  "frontend/src/components/Layout.tsx": "Root layout wrapper component that renders Header, main content area with Outlet for nested routes, and Footer in a flex column structure.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instances based on Internet Identity authentication state, with automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for land registry operations including fetching land records, searching properties, and registering parcels with optimistic updates and real-time synchronization (backend calls currently stubbed).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme color systems using OKLCH color space, plus shimmer animation utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider wrappers around the main App component.",
  "frontend/src/pages/DashboardPage.tsx": "User dashboard displaying authenticated user's land records, pending transfers, and recent activity with loading states and authentication guards (currently using mock data).",
  "frontend/src/pages/HomePage.tsx": "Landing page showcasing the blockchain land registry system with hero section, feature cards highlighting security and automation capabilities, and call-to-action buttons.",
  "frontend/src/pages/PropertyDetailsPage.tsx": "Displays detailed information about a specific land parcel including ownership history, documents, and blockchain verification status. Uses mock data as fallback and includes loading states with skeleton UI.",
  "frontend/src/pages/RegisterPage.tsx": "Provides a form for authenticated users to register new land parcels on the blockchain with fields for parcel ID, coordinates, area, and land use. Shows success confirmation after registration.",
  "frontend/src/pages/SearchPage.tsx": "Implements a search interface for finding land parcels by ID, location, or owner with a grid display of results. Uses mock data as fallback and includes loading states.",
  "frontend/src/pages/TransferPage.tsx": "Handles property ownership transfer for authenticated users by accepting a new owner's principal ID. Shows success confirmation and redirects to dashboard after transfer completion.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom color scheme using OKLCH color space, extended border radius, box shadows, and includes typography, container queries, and animation plugins.",
  "project_state.json": "Project state file tracking a government-grade blockchain land registry system built on Internet Computer Protocol with multi-canister architecture (LandRegistry, Identity, Payment, DocumentVerification). Contains architectural notes, existing features for React Query hooks, UI refinements, real-time synchronization, and refined design system implementation with subtle gradients and elevated depth."
}