{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove all mockup and placeholder data from the application",
  "requirements": [
    {
      "id": "REQ-25",
      "summary": "Remove all mock data from DashboardPage.tsx, replacing with actual data from useQueries hooks or empty state components",
      "acceptanceCriteria": [
        "DashboardPage.tsx contains no hardcoded mock data arrays",
        "All displayed data comes from React Query hooks or shows empty states",
        "Loading states correctly handle the transition from loading to empty/populated states"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Remove all hardcoded mock data arrays including land records, pending transfers, and recent activity. Replace with data fetched exclusively from useQueries hooks. Add conditional rendering to display empty state components when arrays are empty or undefined. Ensure loading states properly transition to either populated data views or empty states."
        }
      ]
    },
    {
      "id": "REQ-26",
      "summary": "Remove all mock data fallbacks from PropertyDetailsPage.tsx, ensuring only real backend data or empty states are displayed",
      "acceptanceCriteria": [
        "PropertyDetailsPage.tsx contains no mock data fallbacks",
        "Component displays only real data from queries or empty state messaging",
        "Error handling is in place for missing or invalid property IDs"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PropertyDetailsPage.tsx",
          "operation": "modify",
          "description": "Remove all mock data fallbacks including hardcoded ownership history, document lists, and verification status. Ensure the component only displays data fetched from backend queries via useQueries hooks. Add error handling for invalid or missing property IDs that shows user-friendly error messages. Add empty state displays when ownership history or documents are unavailable."
        }
      ]
    },
    {
      "id": "REQ-27",
      "summary": "Remove all mock data from SearchPage.tsx, replacing with actual search query results or empty state displays",
      "acceptanceCriteria": [
        "SearchPage.tsx contains no mock search results",
        "Search results come exclusively from backend search queries",
        "Empty state is shown when searches return no results"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SearchPage.tsx",
          "operation": "modify",
          "description": "Remove all hardcoded mock search results arrays. Replace with search results fetched exclusively from useQueries search hooks. Add conditional rendering to display an empty state component when search queries return no results or empty arrays. Preserve existing loading states and ensure they properly transition to either results or empty states."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Remove any stubbed or mock responses from useQueries.ts, ensuring all query hooks make genuine backend actor calls",
      "acceptanceCriteria": [
        "useQueries.ts contains no mock data or stubbed responses",
        "All queries attempt to fetch real data from the backend actor",
        "Error states are properly handled when backend calls fail"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Remove all stubbed responses and mock data fallbacks from query hooks. Ensure all React Query hooks make genuine calls to the backend actor without any mock data fallbacks. Implement proper error handling that surfaces backend call failures to the UI through React Query error states. Preserve existing optimistic update configurations and refetch intervals."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Add appropriate empty state components to pages that display user-friendly messages and CTAs when no data is available",
      "acceptanceCriteria": [
        "Each page has a dedicated empty state component with clear messaging",
        "Empty states include helpful CTAs (e.g., 'Register your first property')",
        "Empty states match the refined design system with proper spacing and typography"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EmptyState.tsx",
          "operation": "create",
          "description": "Create a reusable EmptyState component that accepts props for icon, title, description, and optional CTA button configuration. Style the component using the refined design system with proper OKLCH colors, spacing, and typography. Include subtle animations for the icon and ensure the component is responsive across all screen sizes."
        },
        {
          "path": "frontend/src/pages/DashboardPage.tsx",
          "operation": "modify",
          "description": "Import and integrate the EmptyState component to display when the user has no land records, pending transfers, or recent activity. Configure empty states with appropriate messages like 'No properties registered yet' with a CTA button linking to the register page. Ensure empty states are shown conditionally based on data availability after loading completes."
        },
        {
          "path": "frontend/src/pages/SearchPage.tsx",
          "operation": "modify",
          "description": "Import and integrate the EmptyState component to display when search queries return no results. Configure the empty state with a message like 'No properties match your search' and include helpful text suggesting the user try different search terms. Show the empty state only after a search has been executed with no results."
        },
        {
          "path": "frontend/src/pages/PropertyDetailsPage.tsx",
          "operation": "modify",
          "description": "Import and integrate the EmptyState component to display when property details cannot be loaded or when specific sections like ownership history or documents are empty. Configure appropriate messages for each scenario (e.g., 'Property not found', 'No ownership history available'). Ensure error states are visually distinct from empty data states."
        }
      ]
    }
  ]
}